Python 3.9.10 (tags/v3.9.10:f2f3f53, Jan 17 2022, 15:14:21) [MSC v.1929 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
>>> 
============ RESTART: C:/Users/AISASE/Documents/JY_IDLE/기말_큰수작은수.py ============
입력할 숫자의 갯수 : 4
숫자를 입력: 1
숫자를 입력 : -9
숫자를 입력 : 111
숫자를 입력 : 56
Traceback (most recent call last):
  File "C:/Users/AISASE/Documents/JY_IDLE/기말_큰수작은수.py", line 16, in <module>
    print("최대값 : %d" , "최솟값 : %d" % (max, min))
TypeError: not all arguments converted during string formatting
>>> 
============ RESTART: C:/Users/AISASE/Documents/JY_IDLE/기말_큰수작은수.py ============
입력할 숫자의 갯수 : 3
숫자를 입력: 1
숫자를 입력 : -1
숫자를 입력 : 0
최대값 : 1, 최소값 : -1
>>> aa = [10, 20, 30, 40]
>>> aa
[10, 20, 30, 40]
>>> aa[0]
10
>>> aa[3]
40
>>> aa[5]
Traceback (most recent call last):
  File "<pyshell#4>", line 1, in <module>
    aa[5]
IndexError: list index out of range
>>> type(aa)
<class 'list'>
>>> a, b, c, d = 10, 20, 30, 40
>>> b
20
>>> d
40
>>> c
30
>>> a
10
>>> 
============ RESTART: C:/Users/AISASE/Documents/JY_IDLE/Code07-02.py ===========
1번째 숫자 : 4
2번째 숫자 : 5
3번째 숫자 : 10
4번째 숫자 : 9
합계 ==> 28
>>> 
============= RESTART: C:/Users/AISASE/Documents/JY_IDLE/기말_리스트합.py ============
1번째 숫자 : 1
2번째 숫자 : 2
3번째 숫자 : 3
4번째 숫자 : 4
합계 ==> 10
>>> aa= []
>>> aa.append(1)
>>> aa.append(2)
>>> aa.append(3)
>>> aa.append(4)
>>> aa
[1, 2, 3, 4]
>>> aa.append("hello")
>>> aa
[1, 2, 3, 4, 'hello']
>>> aa.append(3.14)
>>> aa
[1, 2, 3, 4, 'hello', 3.14]
>>> aa.append(False)
>>> a
Traceback (most recent call last):
  File "<pyshell#22>", line 1, in <module>
    a
NameError: name 'a' is not defined
>>> aa
[1, 2, 3, 4, 'hello', 3.14, False]
>>> aa=[]
>>> for i in range(0,100):
	aa.append(0)

	
>>> len(aa)
100
>>> aa
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
>>> 
============ RESTART: C:/Users/AISASE/Documents/JY_IDLE/기말_게임캐릭터.py ============
좋아하는 게임 캐릭터 : 피카츄
Traceback (most recent call last):
  File "C:/Users/AISASE/Documents/JY_IDLE/기말_게임캐릭터.py", line 7, in <module>
    aa.apend(str)
AttributeError: 'list' object has no attribute 'apend'
>>> 
============ RESTART: C:/Users/AISASE/Documents/JY_IDLE/기말_게임캐릭터.py ============
좋아하는 게임 캐릭터 : 피카츄
좋아하는 게임 캐릭터 : 라이츄
좋아하는 게임 캐릭터 : 썬더
['피카츄', '라이츄', '썬더']
>>> 
============= RESTART: C:\Users\AISASE\Documents\JY_IDLE\기말_최고성적.py ============
성적을 입력하시오: 22
성적을 입력하시오: 57
성적을 입력하시오: 84
성적을 입력하시오: 92
성적을 입력하시오: 77
[22, 57, 84, 92, 77]
최고 점수 :  92
>>> hlist = ["x맨", "s맨", "a맨", "아이언 맨", "배트맨"]
>>> ㅚㅑㄴㅅ
Traceback (most recent call last):
  File "<pyshell#31>", line 1, in <module>
    ㅚㅑㄴㅅ
NameError: name 'ᅬᅣᄂᄉ' is not defined
>>> hlist
['x맨', 's맨', 'a맨', '아이언 맨', '배트맨']
>>> if "베트맨" in hlist
SyntaxError: invalid syntax
>>> if "베트맨" in hlist:
	print("있음")

	
>>> 
>>> if "배트맨" in hlist:
	print("있음")

	
있음
>>> if "수퍼맨" in hlist:
	print("없음")

	
>>> if "수퍼맨" not in hlist:
	print("없음")

	
없음
>>> hlist = ["x맨", "s맨", "a맨", "아이언맨", "배트맨"]
index = hlist.index("슈퍼맨")
>>> 
>>> hlist = ["x맨", "s맨", "a맨", "아이언맨", "배트맨"]
>>> 
>>> 
>>> index = hlist.index("슈퍼맨")
Traceback (most recent call last):
  File "<pyshell#54>", line 1, in <module>
    index = hlist.index("슈퍼맨")
ValueError: '슈퍼맨' is not in list
>>> hlist = ["x맨", "s맨", "a맨", "아이언맨", "배트맨"]
>>> index = hlist.index("아이언맨")
>>> 
>>> index = hlist.index("아이언맨")
>>> 
>>> 
>>> 
>>> list = list()
>>> list1 = []
>>> list1
[]
>>> list2 = list("Hello")
Traceback (most recent call last):
  File "<pyshell#65>", line 1, in <module>
    list2 = list("Hello")
TypeError: 'list' object is not callable
>>> list2 = list["Hello"]
Traceback (most recent call last):
  File "<pyshell#66>", line 1, in <module>
    list2 = list["Hello"]
TypeError: list indices must be integers or slices, not str
>>> list3 = list(range(0, 5))
Traceback (most recent call last):
  File "<pyshell#67>", line 1, in <module>
    list3 = list(range(0, 5))
TypeError: 'list' object is not callable
>>> list = list()
Traceback (most recent call last):
  File "<pyshell#68>", line 1, in <module>
    list = list()
TypeError: 'list' object is not callable
>>> list = list()
Traceback (most recent call last):
  File "<pyshell#69>", line 1, in <module>
    list = list()
TypeError: 'list' object is not callable
>>> 
============= RESTART: C:/Users/AISASE/Documents/JY_IDLE/기말_리스트.py =============
Traceback (most recent call last):
  File "C:/Users/AISASE/Documents/JY_IDLE/기말_리스트.py", line 2, in <module>
    list2 = list("Hello") #문자 H,e,l,l,o를 요소로 갖는 리스트 생성
TypeError: 'list' object is not callable
>>> scores = [ 32, 56, 64, 72, 12, 37, 98, 77, 59, 69]
>>> 
>>> for element in scores:
	print(element)

	
32
56
64
72
12
37
98
77
59
69
>>> 
============ RESTART: C:/Users/AISASE/Documents/JY_IDLE/Code07-04.py ===========
bb[0]에는 198이, bb[99]에는 0이 입력됩니다.
>>> 
============ RESTART: C:/Users/AISASE/Documents/JY_IDLE/Code07-04.py ===========
aa의 길이 :  100
[0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122, 124, 126, 128, 130, 132, 134, 136, 138, 140, 142, 144, 146, 148, 150, 152, 154, 156, 158, 160, 162, 164, 166, 168, 170, 172, 174, 176, 178, 180, 182, 184, 186, 188, 190, 192, 194, 196, 198]

 bb의 길이 :  100
[198, 196, 194, 192, 190, 188, 186, 184, 182, 180, 178, 176, 174, 172, 170, 168, 166, 164, 162, 160, 158, 156, 154, 152, 150, 148, 146, 144, 142, 140, 138, 136, 134, 132, 130, 128, 126, 124, 122, 120, 118, 116, 114, 112, 110, 108, 106, 104, 102, 100, 98, 96, 94, 92, 90, 88, 86, 84, 82, 80, 78, 76, 74, 72, 70, 68, 66, 64, 62, 60, 58, 56, 54, 52, 50, 48, 46, 44, 42, 40, 38, 36, 34, 32, 30, 28, 26, 24, 22, 20, 18, 16, 14, 12, 10, 8, 6, 4, 2, 0]bb[0]에는 198이, bb[99]에는 0이 입력됩니다.
>>> 
============ RESTART: C:/Users/AISASE/Documents/JY_IDLE/Code07-04.py ===========
aa의 길이 :  100
[0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122, 124, 126, 128, 130, 132, 134, 136, 138, 140, 142, 144, 146, 148, 150, 152, 154, 156, 158, 160, 162, 164, 166, 168, 170, 172, 174, 176, 178, 180, 182, 184, 186, 188, 190, 192, 194, 196, 198]

 bb의 길이 :  100
[198, 196, 194, 192, 190, 188, 186, 184, 182, 180, 178, 176, 174, 172, 170, 168, 166, 164, 162, 160, 158, 156, 154, 152, 150, 148, 146, 144, 142, 140, 138, 136, 134, 132, 130, 128, 126, 124, 122, 120, 118, 116, 114, 112, 110, 108, 106, 104, 102, 100, 98, 96, 94, 92, 90, 88, 86, 84, 82, 80, 78, 76, 74, 72, 70, 68, 66, 64, 62, 60, 58, 56, 54, 52, 50, 48, 46, 44, 42, 40, 38, 36, 34, 32, 30, 28, 26, 24, 22, 20, 18, 16, 14, 12, 10, 8, 6, 4, 2, 0]

 bb[0]에는 198이, bb[99]에는 0이 입력됩니다.
>>> 
============ RESTART: C:/Users/AISASE/Documents/JY_IDLE/Code07-04.py ===========
aa의 길이 :  200
[0, 3, 6, 9, 12, 15, 18, 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63, 66, 69, 72, 75, 78, 81, 84, 87, 90, 93, 96, 99, 102, 105, 108, 111, 114, 117, 120, 123, 126, 129, 132, 135, 138, 141, 144, 147, 150, 153, 156, 159, 162, 165, 168, 171, 174, 177, 180, 183, 186, 189, 192, 195, 198, 201, 204, 207, 210, 213, 216, 219, 222, 225, 228, 231, 234, 237, 240, 243, 246, 249, 252, 255, 258, 261, 264, 267, 270, 273, 276, 279, 282, 285, 288, 291, 294, 297, 300, 303, 306, 309, 312, 315, 318, 321, 324, 327, 330, 333, 336, 339, 342, 345, 348, 351, 354, 357, 360, 363, 366, 369, 372, 375, 378, 381, 384, 387, 390, 393, 396, 399, 402, 405, 408, 411, 414, 417, 420, 423, 426, 429, 432, 435, 438, 441, 444, 447, 450, 453, 456, 459, 462, 465, 468, 471, 474, 477, 480, 483, 486, 489, 492, 495, 498, 501, 504, 507, 510, 513, 516, 519, 522, 525, 528, 531, 534, 537, 540, 543, 546, 549, 552, 555, 558, 561, 564, 567, 570, 573, 576, 579, 582, 585, 588, 591, 594, 597]

 bb의 길이 :  200
[297, 294, 291, 288, 285, 282, 279, 276, 273, 270, 267, 264, 261, 258, 255, 252, 249, 246, 243, 240, 237, 234, 231, 228, 225, 222, 219, 216, 213, 210, 207, 204, 201, 198, 195, 192, 189, 186, 183, 180, 177, 174, 171, 168, 165, 162, 159, 156, 153, 150, 147, 144, 141, 138, 135, 132, 129, 126, 123, 120, 117, 114, 111, 108, 105, 102, 99, 96, 93, 90, 87, 84, 81, 78, 75, 72, 69, 66, 63, 60, 57, 54, 51, 48, 45, 42, 39, 36, 33, 30, 27, 24, 21, 18, 15, 12, 9, 6, 3, 0, 597, 594, 591, 588, 585, 582, 579, 576, 573, 570, 567, 564, 561, 558, 555, 552, 549, 546, 543, 540, 537, 534, 531, 528, 525, 522, 519, 516, 513, 510, 507, 504, 501, 498, 495, 492, 489, 486, 483, 480, 477, 474, 471, 468, 465, 462, 459, 456, 453, 450, 447, 444, 441, 438, 435, 432, 429, 426, 423, 420, 417, 414, 411, 408, 405, 402, 399, 396, 393, 390, 387, 384, 381, 378, 375, 372, 369, 366, 363, 360, 357, 354, 351, 348, 345, 342, 339, 336, 333, 330, 327, 324, 321, 318, 315, 312, 309, 306, 303, 300]

 bb[0]에는 297이, bb[99]에는 0이 입력됩니다.
>>> 
============ RESTART: C:/Users/AISASE/Documents/JY_IDLE/Code07-04.py ===========
aa의 길이 :  200
[0, 3, 6, 9, 12, 15, 18, 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63, 66, 69, 72, 75, 78, 81, 84, 87, 90, 93, 96, 99, 102, 105, 108, 111, 114, 117, 120, 123, 126, 129, 132, 135, 138, 141, 144, 147, 150, 153, 156, 159, 162, 165, 168, 171, 174, 177, 180, 183, 186, 189, 192, 195, 198, 201, 204, 207, 210, 213, 216, 219, 222, 225, 228, 231, 234, 237, 240, 243, 246, 249, 252, 255, 258, 261, 264, 267, 270, 273, 276, 279, 282, 285, 288, 291, 294, 297, 300, 303, 306, 309, 312, 315, 318, 321, 324, 327, 330, 333, 336, 339, 342, 345, 348, 351, 354, 357, 360, 363, 366, 369, 372, 375, 378, 381, 384, 387, 390, 393, 396, 399, 402, 405, 408, 411, 414, 417, 420, 423, 426, 429, 432, 435, 438, 441, 444, 447, 450, 453, 456, 459, 462, 465, 468, 471, 474, 477, 480, 483, 486, 489, 492, 495, 498, 501, 504, 507, 510, 513, 516, 519, 522, 525, 528, 531, 534, 537, 540, 543, 546, 549, 552, 555, 558, 561, 564, 567, 570, 573, 576, 579, 582, 585, 588, 591, 594, 597]

 bb의 길이 :  200
[597, 594, 591, 588, 585, 582, 579, 576, 573, 570, 567, 564, 561, 558, 555, 552, 549, 546, 543, 540, 537, 534, 531, 528, 525, 522, 519, 516, 513, 510, 507, 504, 501, 498, 495, 492, 489, 486, 483, 480, 477, 474, 471, 468, 465, 462, 459, 456, 453, 450, 447, 444, 441, 438, 435, 432, 429, 426, 423, 420, 417, 414, 411, 408, 405, 402, 399, 396, 393, 390, 387, 384, 381, 378, 375, 372, 369, 366, 363, 360, 357, 354, 351, 348, 345, 342, 339, 336, 333, 330, 327, 324, 321, 318, 315, 312, 309, 306, 303, 300, 297, 294, 291, 288, 285, 282, 279, 276, 273, 270, 267, 264, 261, 258, 255, 252, 249, 246, 243, 240, 237, 234, 231, 228, 225, 222, 219, 216, 213, 210, 207, 204, 201, 198, 195, 192, 189, 186, 183, 180, 177, 174, 171, 168, 165, 162, 159, 156, 153, 150, 147, 144, 141, 138, 135, 132, 129, 126, 123, 120, 117, 114, 111, 108, 105, 102, 99, 96, 93, 90, 87, 84, 81, 78, 75, 72, 69, 66, 63, 60, 57, 54, 51, 48, 45, 42, 39, 36, 33, 30, 27, 24, 21, 18, 15, 12, 9, 6, 3, 0]

 bb[0]에는 597이, bb[99]에는 300이 입력됩니다.
>>> 